Reports/омг_ДанныеМедицинскихЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>омг_ДанныеМедицинскихЛицензий</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/омг_ДанныеМедицинскихЛицензий/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") Тогда 
		    		Филиал = ПолучитьФилиалПользователя();

			ОтборПоФилиалу = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоФилиалу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал");
			ОтборПоФилиалу.ПравоеЗначение = Филиал;
			ОтборПоФилиалу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли; 

КонецПроцедуры


&НаСервере
Функция ПолучитьФилиалПользователя()
	НастройкаОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПользователей.Значение КАК Организация
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &НастройкаОрганизация";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОрганизация", НастройкаОрганизация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
	    ОсновнаяОрганизация = Выборка.Организация
	КонецЕсли;
    Возврат ОсновнаяОрганизация;
		
КонецФункции
